# GetSaveModifiedLinksOption Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ISaveSharedCoordinatesCallback..::..GetSaveModifiedLinksOption Method
ISaveSharedCoordinatesCallback Interface See Also
---
Determines whether Revit should save the link, not save the link, or discard shared positioning entirely.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
SaveModifiedLinksOptions GetSaveModifiedLinksOption(
	RevitLinkType link
)
```

Visual Basic
---
```text
Function GetSaveModifiedLinksOption ( _
	link As RevitLinkType _
) As SaveModifiedLinksOptions
```

Visual C++
---
```text
SaveModifiedLinksOptions GetSaveModifiedLinksOption(
	RevitLinkType^ link
)
```

# ### Parameters
link
    Type: Autodesk.Revit.DB..::..RevitLinkType The Revit link which has modified shared coordinates.
# ### Return Value
The options when saving a linked file which has been modified in-memory by shared coordinates operations.
# See Also
ISaveSharedCoordinatesCallback Interface
Autodesk.Revit.DB Namespace